app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories"
---
  def index
    @products = Product.all
    @categories = Category.all

SELECT  "categories".* FROM "categories"  WHERE "categories"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "products".* FROM "products"  WHERE "products"."category_id" = ?  ORDER BY "products"."id" ASC LIMIT 1  [["category_id", 1]]
SELECT "categories".* FROM "categories"
---
  def show
    @products = Category.find_by_id(params[:id]).products
    @categories = Category.all