app/controllers/main_controller.rb

  def index
    @products = Product.all.page(params[:page]).per(3)
    @categories = Category.all
---
SELECT  "products".* FROM "products"  LIMIT 3 OFFSET 0
SELECT COUNT(*) FROM "products"
SELECT "categories".* FROM "categories"