app/controllers/pages_controller.rb

SELECT  "pages".* FROM "pages"  WHERE "pages"."permalink" = 'about' LIMIT 1
SELECT "categories".* FROM "categories"
---
  def about
    @page = Page.where(permalink: 'about').take
    @categories = Category.all

SELECT  "pages".* FROM "pages"  WHERE "pages"."permalink" = 'contact' LIMIT 1
SELECT "categories".* FROM "categories"
---
  def contact
    @page = Page.where(permalink: 'contact').take
    @categories = Category.all