app/controllers/products_controller.rb

  def index
    @products = Product.all
    @categories = Category.all
---
SELECT "products".* FROM "products"
SELECT "categories".* FROM "categories"

  def show
    @product = Product.find(params[:id])
    @categories = Category.all
---
SELECT  "products".* FROM "products"  WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
SELECT "categories".* FROM "categories"